test_like_a_hero/app/controllers/weapons_controller.rb

SELECT "weapons".* FROM "weapons"
---
  def index
    @weapons = Weapon.all

INSERT INTO "weapons" ("name", "description", "power_base", "power_step", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "AK-47"], ["description", "First Thief"], ["power_base", 3291], ["power_step", 341], ["created_at", "2022-07-29 07:04:15.447599"], ["updated_at", "2022-07-29 07:04:15.447599"]]
---
  def create
    @weapon = Weapon.create(weapon_params)

DELETE FROM "weapons" WHERE "weapons"."id" = ?  [["id", 1]]
---
  def destroy
    @weapon.destroy

SELECT  "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def search_with_id
    @weapon = Weapon.find_by_id(params.try(:[], :id))